{
  "books" : [
    {
      "title" : "1984",
      "author" : "George Orwell",
      "summary" : "Winston Smith is a member of the Outer Party. He works in the Records Department in the Ministry of Truth, rewriting and distorting history. To escape Big Brother's tyranny, at least inside his own mind, Winston begins a diary — an act punishable by death. Winston is determined to remain human under inhuman circumstances. Yet telescreens are placed everywhere — in his home, in his cubicle at work, in the cafeteria where he eats, even in the bathroom stalls. His every move is watched. No place is safe. One day, while at the mandatory Two Minutes Hate, Winston catches the eye of an Inner Party Member, O'Brien, whom he believes to be an ally. He also catches the eye of a dark-haired girl from the Fiction Department, whom he believes is his enemy and wants him destroyed. A few days later, Julia, the dark-haired girl whom Winston believes to be against him, secretly hands him a note that reads, \"I love you.\" Winston takes pains to meet her, and when they finally do, Julia draws up a complicated plan whereby they can be alone. Alone in the countryside, Winston and Julia make love and begin their allegiance against the Party and Big Brother. Winston is able to secure a room above a shop where he and Julia can go for their romantic trysts. Winston and Julia fall in love, and, while they know that they will someday be caught, they believe that the love and loyalty they feel for each other can never be taken from them, even under the worst circumstances. Eventually, Winston and Julia confess to O'Brien, whom they believe to be a member of the Brotherhood (an underground organization aimed at bringing down the Party), their hatred of the Party. O'Brien welcomes them into the Brotherhood with an array of questions and arranges for Winston to be given a copy of \"the book\", the underground's treasonous volume written by their leader, Emmanuel Goldstein, former ally of Big Brother turned enemy. Winston gets the book at a war rally and takes it to the secure room where he reads it with Julia napping by his side. The two are disturbed by a noise behind a painting in the room and discover a telescreen. They are dragged away and separated. Winston finds himself deep inside the Ministry of Love, a kind of prison with no windows, where he sits for days alone. Finally, O'Brien comes. Initially Winston believes that O'Brien has also been caught, but he soon realizes that O'Brien is there to torture him and break his spirit. The Party had been aware of Winston's \"crimes\" all along; in fact, O'Brien has been watching Winston for the past seven years. O'Brien spends the next few months torturing Winston in order to change his way of thinking — to employ the concept of doublethink, or the ability to simultaneously hold two opposing ideas in one's mind and believe in them both. Winston believes that the human mind must be free, and to remain free, one must be allowed to believe in an objective truth, such as 2 + 2 = 4. O'Brien wants Winston to believe that 2 + 2 = 5, but Winston is resistant. Finally, O'Brien takes Winston to Room 101, the most dreaded room of all in the Ministry of Love, the place where prisoners meet their greatest fear. Winston's greatest fear is rats. O'Brien places over Winston's head a mask made of wire mesh and threatens to open the door to release rats on Winston's face. When Winston screams, \"Do it to Julia!\" he relinquishes his last vestige of humanity. Winston is a changed man. He sits in the Chestnut Tree Café, watching the telescreens and agonizing over the results of daily battles on the front lines. He has seen Julia again. She, too, is changed, seeming older and less attractive. She admits that she also betrayed him. In the end, there is no doubt, Winston loves Big Brother.",
      "genre" : "dystopian"
    },
    {
      "title" : "Animal Farm",
      "author" : "George Orwell",
      "summary" : "One night, all the animals at Mr. Jones' Manor Farm assemble in a barn to hear old Major, a pig, describe a dream he had about a world where all animals live free from the tyranny of their human masters. old Major dies soon after the meeting, but the animals — inspired by his philosophy of Animalism — plot a rebellion against Jones. Two pigs, Snowball and Napoleon, prove themselves important figures and planners of this dangerous enterprise. When Jones forgets to feed the animals, the revolution occurs, and Jones and his men are chased off the farm. Manor Farm is renamed Animal Farm, and the Seven Commandments of Animalism are painted on the barn wall. Initially, the rebellion is a success: The animals complete the harvest and meet every Sunday to debate farm policy. The pigs, because of their intelligence, become the supervisors of the farm. Napoleon, however, proves to be a power-hungry leader who steals the cows' milk and a number of apples to feed himself and the other pigs. He also enlists the services of Squealer, a pig with the ability to persuade the other animals that the pigs are always moral and correct in their decisions. Later that fall, Jones and his men return to Animal Farm and attempt to retake it. Thanks to the tactics of Snowball, the animals defeat Jones in what thereafter becomes known as The Battle of the Cowshed. Winter arrives, and Mollie, a vain horse concerned only with ribbons and sugar, is lured off the farm by another human. Snowball begins drawing plans for a windmill, which will provide electricity and thereby give the animals more leisure time, but Napoleon vehemently opposes such a plan on the grounds that building the windmill will allow them less time for producing food. On the Sunday that the pigs offer the windmill to the animals for a vote, Napoleon summons a pack of ferocious dogs, who chase Snowball off the farm forever. Napoleon announces that there will be no further debates; he also tells them that the windmill will be built after all and lies that it was his own idea, stolen by Snowball. For the rest of the novel, Napoleon uses Snowball as a scapegoat on whom he blames all of the animals' hardships. Much of the next year is spent building the windmill. Boxer, an incredibly strong horse, proves himself to be the most valuable animal in this endeavor. Jones, meanwhile, forsakes the farm and moves to another part of the county. Contrary to the principles of Animalism, Napoleon hires a solicitor and begins trading with neighboring farms. When a storm topples the half-finished windmill, Napoleon predictably blames Snowball and orders the animals to begin rebuilding it. Napoleon's lust for power increases to the point where he becomes a totalitarian dictator, forcing \"confessions\" from innocent animals and having the dogs kill them in front of the entire farm. He and the pigs move into Jones' house and begin sleeping in beds (which Squealer excuses with his brand of twisted logic). The animals receive less and less food, while the pigs grow fatter. After the windmill is completed in August, Napoleon sells a pile of timber to Jones; Frederick, a neighboring farmer who pays for it with forged banknotes. Frederick and his men attack the farm and explode the windmill but are eventually defeated. As more of the Seven Commandments of Animalism are broken by the pigs, the language of the Commandments is revised: For example, after the pigs become drunk one night, the Commandment, \"No animals shall drink alcohol\" is changed to, \"No animal shall drink alcohol to excess.\" Boxer again offers his strength to help build a new windmill, but when he collapses, exhausted, Napoleon sells the devoted horse to a knacker (a glue-boiler). Squealer tells the indignant animals that Boxer was actually taken to a veterinarian and died a peaceful death in a hospital — a tale the animals believe. Years pass and Animal Farm expands its boundaries after Napoleon purchases two fields from another neighboring farmer, Pilkington. Life for all the animals (except the pigs) is harsh. Eventually, the pigs begin walking on their hind legs and take on many other qualities of their former human oppressors. The Seven Commandments are reduced to a single law: \"All Animals Are Equal / But Some Are More Equal Than Others.\" The novel ends with Pilkington sharing drinks with the pigs in Jones' house. Napoleon changes the name of the farm back to Manor Farm and quarrels with Pilkington during a card game in which both of them try to play the ace of spades. As other animals watch the scene from outside the window, they cannot tell the pigs from the humans.",
      "genre" : "political satire"
    },
    {
      "title" : "The Gift of the Magi",
      "authorId" : "O.Henry",
      "summary" : "The story opens with $1.87. That's all Della Dillingham Young has to buy a present for her beloved husband, Jim. And the next day is Christmas. Faced with such a situation, Della promptly bursts into tears on the couch, which gives the narrator the opportunity to tell us a bit more about the situation of Jim and Della. The short of it is they live in a shabby flat and they're poor. But they love each other. Once Della's recovered herself, she goes to a mirror to let down her hair and examine it. Della's beautiful, brown, knee-length hair is one of the two great treasures of the poor couple. The other is Jim's gold watch. Her hair examined, Della puts it back up, sheds a tear, and bundles up to head out into the cold. She leaves the flat and walks to Madame Sofronie's hair goods shop, where she sells her hair for twenty bucks. Now she has $21.87 cents. With her new funds, Della is able to find Jim the perfect present: an elegant platinum watch chain for his watch. It's $21, and she buys it. Excited by her gift, Della returns home and tries to make her now-short hair presentable (with a curling iron). She's not convinced Jim will approve, but she did what she had to do to get him a good present. When she finishes with her hair, she gets to work preparing coffee and dinner. Jim arrives at 7pm to find Della waiting by the door and stares fixedly at her, not able to understand that Della's hair is gone. Della can't understand quite what his reaction means.  After a little while, Jim snaps out of it and gives Della her present, explaining that his reaction will make sense when she opens it. Della opens it and cries out in joy, only to burst into tears immediately afterward. Jim has given her the set of fancy combs she's wanted for ages, only now she has no hair for them. Jim nurses Della out of her sobs. Once she's recovered she gives Jim his present, holding out the watch chain. Jim smiles, falling back on the couch. He sold his watch to buy Della's combs, he explains. He recommends they put away their presents and have dinner. As they do so, the narrator brings the story to a close by pronouncing that Della and Jim are the wisest of everyone who gives gifts. They are the magi.",
      "genre" : "short story"
    }
  ],
"authors" : [
    {
      "id" : 1,
      "fullName" : "George Orwell",
      "biography" : "George Orwell is the pen name of Eric Arthur Blair: essayist, novelist, literary critic, advocate and fighter for political change, and man of contradictions. Blair was born on June 25, 1903, in the Bengal region of Eastern India, which was a British territory. He was the son of Richard Walmesley Blair, a civil servant, and Ida Mabel Blair. Their only son was the middle child. He moved to England with his mother and sisters at the age of one. He displayed academic talent from a young age, so his mother took pains to ensure his attendance at a well-known boarding school called St. Cyprian’s. His family was neither poor nor wealthy, and Blair attended St. Cyprian’s on a scholarship. Blair excelled academically there but faced many hardships in its puritanical, cutthroat environment. In the autobiographical essay “Such, Such Were the Joys,” Blair/Orwell describes the social challenges he endured as a scholarship student among England’s wealthy elite. (These challenges would inform his satires of social stratification in his literary works, including Animal Farm.) In the essay, he describes his child self with much sympathy and feeling for the child's perspective. Such experiments in empathy prepared him to create Animal Farm's brilliantly naive narrator. Blair’s academic prowess continued in secondary school at Eton, a renowned secondary school (more recently famous for Prince William's attendance there). Blair graduated from Eton in 1921. Despite his intelligence, he could not afford to attend college. In 1922, he joined the Indian Imperial Police in Burma. He had spent the first year of his life in a British colony, and this time, he got a thorough experience of British colonial life and despised what he saw. His experiences made him a champion of the poor and downtrodden, a role in which he would continue for the rest of his life. Moreover, he could not stand the fact that his job put him directly in the position of privileged oppressor. He resigned from the Indian Imperial Police five years later while on leave in England. Blair/Orwell thus became devoted to the problems of class and government power long before he wrote Animal Farm. As Louis Menand writes, \"He turned his life into an experiment in classlessness, and the intensity of his commitment to that experiment was the main reason that his friends and colleagues found him a perverse and sometimes exasperating man.\" To complete his rejection of elitism, Blair lived after the fashion of the poorest Englanders. This included refusing to wear warm clothing in winter or to display table manners. It is questionable whether his destitute lifestyle contributed to his frequent illnesses, but such choices indubitably influenced his written works. Blair tried his luck in Paris briefly but found he could not make a living there as a writer. He returned to England in 1929, where he published essays and continued his fascination with and incorporation into the dregs of society. He began to slip into poverty in earnest, so he took a job as a teacher at Frays College. He also secured himself a literary agent. Blair/Orwell published Down and Out in Paris in 1932. Before the book’s publication, Blair assumed the pen name by which he would become famous. Accounts of why the writer chose the pen name “George Orwell” vary. Some say the name is deeply symbolic while others state that it was merely one of a list of names from which he allowed his publishers to choose. From 1934 on, Orwell thrust himself fully into the writer’s arena. He quit his teaching job and moved to Hempstead, an epicenter for young writers at the time, where he worked in a used-book store. He published his first fictional work, Burmese Days, in 1934, and followed with A Clergyman’s Daughter in 1935. Orwell’s presence in Hempstead and his interest in the lower class did not go unnoticed. In 1936, the Left Book Club commissioned him to write an account of the destitute state of Northern England. Orwell threw himself into the project, conducting firsthand research in his quest for authenticity. In his travels, he met and married Eileen O’Shaughnessy. The controversial account was published in 1936 under the name The Road to Wigan Pier. He published Aspidistra Flying in the same year. Around the time The Road to Wigan Pier was published, Orwell took his offensive against elitism and tyranny a step further, volunteering to fight in the Spanish Civil War on the side of the Republicans. He joined POUM, a Trotskyist socialist party that emphasized the need for a working-class uprising and opposed the Spanish Communist Party’s belief in collaborating with the middle class (Orwell was a revolutionary socialist). Orwell’s experiences in the war, including being shot almost fatally, cemented his hatred of totalitarianism in its many guises. This included Stalinism, against which he held a lifetime grudge. Ironically, Orwell’s neck injury very nearly—and literally—robbed the outspoken writer of his voice. However, he did recover, and while doing so Orwell completed a novel, Coming Up for Air. Orwell described his social observations of Spain in Homage to Catalonia. In 1940, Orwell and his wife moved to central London, where he worked as a reviewer. When World War II began, he rose to fight for the cause of freedom again, this time for England. He joined the Home Guard and worked for the BBC to compose and disseminate wartime propaganda. Orwell knew of what he spoke when he skewered propaganda in Animal Farm and 1984. Orwell based his satires not just on hearsay and research but also on personal experience; writing propaganda is said to have made him feel corrupt. He was also a war correspondent. During wartime, Orwell and his wife adopted a son, but his wife died shortly afterwards. Also during this time, Orwell completed Animal Farm, which was published in England in 1945. It was at this point, just when Orwell’s personal life was in shambles, that his legend took flight. The book met with immediate and far-reaching public success, especially since it was so topical. Orwell continued to write for periodicals while completing his second renowned novel, 1984. He remarried in 1949, to Sonia Brownell. Orwell, who was prone to illness, had his career and his life cut short when he died of tuberculosis on January 21, 1950. Orwell’s friend, David Astor, saw to it that he was buried in a small county churchyard. Orwell is buried under his birth name. He left a strong literary and political legacy, being one of those artists who influenced not only the literary universe, but also the real world in which he lived. As he wrote in \"Politics and the English Language\": \"In our age there is no such thing as 'keeping out of politics.' All issues are political issues, and politics itself is a mass of lies, evasions, folly, hatred and schizophrenia.\" This statement also illustrates the pessimism for which Orwell was known. Like some other disillusioned people of his generation, Orwell believed that totalitarian governments would inevitably take over the West."
    },
    {
      "id" : 2,
      "fullName" : "O.Henry",
      "biography" : " The American short story writer O. Henry (1862 - 1910) was born under the name William Sydney Porter in Greensboro, North Carolina in 1862. His short stories are well known throughout the world; noted for their witticism, clever wordplay, and unexpected \"twist\" endings. Like many other writers, O. Henry's early career aspirations were unfixed and he wandered across different activities and professions before he finally found his calling as a short story writer. He started working in his uncle's drugstore in 1879 and became a licensed pharmacist by the age of 19. His first creative expressions came while working in the pharmacy where he would sketch the townspeople that frequented the store. The customers reacted warmly to his sketches and he was admired for his artistry and sketching skills. O. Henry moved to Texas in March of 1882 hoping to get rid of a persistent cough that he had developed. While there, he took up residence on a sheep ranch, learned shepherding, cooking, babysitting, and bits of Spanish and German from the many migrant farmhands. He had an active social life in Austin and was a fine musician, skilled with the guitar and mandolin. Over the next several years, Porter -- as he was still known -- took a number of different jobs, from pharmacy to drafting, journalism and banking. But banking in particular was not to be O. Henry's calling; he was quite careless with his bookkeeping and may have crossed some ethical and legal boundaries. In 1894, the bank accused him of embezzlement. He lost his job but was not indicted. He was always a lover of classic literature, and while pursuing these other ventures, O. Henry had begun writing as a hobby. When he lost his banking job he moved to Houston in 1895 and started writing for the The Post, earning $25 per month (an average salary at this time in American history was probably about $300 a year, less than a dollar a day). O. Henry collected ideas for his column by loitering in hotel lobbies and observing and talking to people there. He relied on this technique to gain creative inspiration throughout his writing career; which is a fun fact to keep in mind while reading a story like Transients in Arcadia. O. Henry's prolific writing period began in 1902 in New York City, where he wrote 381 short stories. He wrote one story a week for The New York World Sunday Magazine for over a year. Some of his best and least known work is contained in Cabbages and Kings, his first collection of published stories, set in a central American town, in which sub-plots and larger plots are interwoven in an engaging manner. His second collection of stories, The Four Million, was released in 1906. The stories are set in New York City and the title is based on the population of the city at that time. The collection contained several short story masterpieces, including The Gift of the Magi, The Cop and the Anthem, and many others. Henry had an obvious affection for New York City, a reverence that rises up through some of these stories. O. Henry's trademark is his witty, plot-twisting endings, and his warm characterization of the awkward and difficult situations and the creative ways people find to resolve them. His most famous short story, The Gift of the Magi, epitomizes his style. It's a story about a young married couple, short on money, that wishes to buy each other Christmas gifts. That problem -- their lack of funds -- finds a famously endearing and ironic resolution. The Cop and the Anthem is about A New York City hobo with a creative solution for dealing with the cold city streets during winter. Another story, A Retrieved Reformation, is about a safecracker Jimmy Valentine, fresh from prison, whose life takes an unexpected turn while casing his next crime scene. The Ransom of Red Chief, a story about two hapless kidnappers that snatch the wrong boy. All of these stories are highly entertaining, they are read for pleasure and in classrooms around the world. In 1952 Marilyn Monroe and Charles Laughton starred in O. Henry's Full House, a film featuring five stories of O. Henry's short stories. The film included The Cop and the Anthem and four other O. Henry stories: The Clarion Call, The Last Leaf, The Ransom of Red Chief (starring Fred Allen and Oscar Levant), and The Gift of the Magi. Unfortunately, O. Henry's personal tragedy was heavy drinking and by 1908 his health had deteriorated and his writing dropped off accordingly. He died in 1910 of cirrhosis of the liver, complications of diabetes, and an enlarged heart. The funeral was held in New York City, but he was buried in North Carolina, the state where he was born. He was a gifted short story writer, and left us a rich legacy of great stories to enjoy."
    }
  ]
}
